In [1]:
import pandas as pd
import numpy as np

In [32]:
df = pd.read_csv('df.csv')
# drop NA values
df = df.dropna()

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 836 entries, 0 to 1384
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              836 non-null    int64
 1   Name            836 non-null    object
 2   State           836 non-null    object
 3   Region          836 non-null    object
 4   Applications    836 non-null    int64
 5   Admissions      836 non-null    int64
 6   Admission Rate  836 non-null    float64
 7   Enrollment      836 non-null    int64
 8   SATVR75         836 non-null    float64
 9   SATMT75         836 non-null    float64
 10  ACTEN75         836 non-null    float64
 11  ACTMT75         836 non-null    float64
dtypes: float64(5), int64(4), object(3)
memory usage: 84.9+ KB

In [34]:
df.head()

,ID,Name,State,Region,Applications,Admissions,Admission Rate,Enrollment,SATVR75,SATMT75,ACTEN75,ACTMT75
0,100654,Alabama A & M University,Alabama,Southeast,6560,4697,0.716006,1459,520.0,510.0,20.0,18.0
1,100663,University of Alabama at Birmingham,Alabama,Southeast,11906,10541,0.885352,2361,680.0,708.0,33.0,28.0
2,100706,University of Alabama in Huntsville,Alabama,Southeast,5781,4259,0.736724,1191,700.0,720.0,32.0,29.0
3,100724,Alabama State University,Alabama,Southeast,5974,5854,0.979913,797,534.0,516.0,22.0,19.0
4,100751,The University of Alabama,Alabama,Southeast,42421,33472,0.789043,7540,680.0,690.0,33.0,28.0

In [35]:
col_math_sat = 'SATMT75'
math_100_sample = df[col_math_sat].sample(100, random_state=1)

In [36]:
#math_100_sample.info()
mean_math_100 = math_100_sample.mean()
print(f'{mean_math_100:.2f}')

630.36

In [37]:
# lấy mẫu ngẫu nhiên 150 samples từ cột Verbal của SAT và tính trung bình mẫu
col_verbal_sat = 'SATVR75'
verbal_150_sample = df[col_verbal_sat].sample(150)
avg_verbal_sat = verbal_150_sample.mean()
print(f'{avg_verbal_sat:.2f}')

630.11

In [90]:
df_sample = pd.DataFrame(columns=['Region', col_math_sat])
for region, df_group in df.groupby('Region'):
    #print(f'Region: {region}')
    #print(df_group.describe())
    sample_size = int(len(df_group) / 10)
    if sample_size == 0:
        sample_size = 1
    sample_region = df_group.sample(sample_size)
    df_sample = pd.concat([df_sample, sample_region[['Region', col_math_sat]]], ignore_index=True)
    mean_sample_math = sample_region[col_math_sat].mean()
    print(f'Region: {region}, Mean Math SAT: {mean_sample_math:.2f}')

mean_math = df_sample[col_math_sat].mean()
print(f'Mean Math SAT of all regions: {mean_math:.2f}')

Region: Far West, Mean Math SAT: 704.00
Region: Great Lakes, Mean Math SAT: 613.00
Region: Mid East, Mean Math SAT: 633.17
Region: New England, Mean Math SAT: 694.60
Region: Other US Jurisdctn, Mean Math SAT: 490.00
Region: Plains, Mean Math SAT: 650.89
Region: Rocky Mountains, Mean Math SAT: 585.00
Region: Southeast, Mean Math SAT: 604.38
Region: Southwest, Mean Math SAT: 622.86
Region: US Service Schools, Mean Math SAT: 700.00
Mean Math SAT of all regions: 628.01

/var/folders/10/3dssf0p51vzgb7zfm9xl0vrm0000gn/T/ipykernel_12934/1398546313.py:9: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  df_sample = pd.concat([df_sample, sample_region[['Region', col_math_sat]]], ignore_index=True)

In [93]:
# Lấy mẫu phân tầng theo State để tính trung bình SAT verbal
col_verbal_sat = 'SATVR75'
df_sample = pd.DataFrame(columns=['State', col_verbal_sat])

for state, df_group in df.groupby('State'):
    sample_size = int(len(df_group) / 10)  
    if sample_size == 0:
        sample_size = 1 # get 1 random sample if the group is too small
    sample_state = df_group.sample(sample_size)
    df_sample = pd.concat([df_sample, sample_state[['State', col_verbal_sat]]], ignore_index=True)

    mean_sample_verbal = sample_state[col_verbal_sat].mean()
    print(f'State: {state}, Mean Verbal SAT: {mean_sample_verbal:.2f}')
mean_verbal = df_sample[col_verbal_sat].mean()
print(f'\nMean Verbal SAT of all states: {mean_verbal:.2f}')

State: Alabama, Mean Verbal SAT: 595.00
State: Alaska, Mean Verbal SAT: 680.00
State: Arizona, Mean Verbal SAT: 660.00
State: Arkansas, Mean Verbal SAT: 590.00
State: California, Mean Verbal SAT: 695.00
State: Colorado, Mean Verbal SAT: 630.00
State: Connecticut, Mean Verbal SAT: 730.00
State: Delaware, Mean Verbal SAT: 670.00
State: District of Columbia, Mean Verbal SAT: 740.00
State: Florida, Mean Verbal SAT: 663.33
State: Georgia, Mean Verbal SAT: 590.00
State: Hawaii, Mean Verbal SAT: 650.00
State: Idaho, Mean Verbal SAT: 630.00
State: Illinois, Mean Verbal SAT: 650.00
State: Indiana, Mean Verbal SAT: 613.33
State: Iowa, Mean Verbal SAT: 654.00
State: Kansas, Mean Verbal SAT: 660.00
State: Kentucky, Mean Verbal SAT: 558.00
State: Louisiana, Mean Verbal SAT: 640.00
State: Maine, Mean Verbal SAT: 630.00
State: Maryland, Mean Verbal SAT: 700.00
State: Massachusetts, Mean Verbal SAT: 715.00
State: Michigan, Mean Verbal SAT: 585.00
State: Minnesota, Mean Verbal SAT: 720.00
State: Mississippi, Mean Verbal SAT: 440.00
State: Missouri, Mean Verbal SAT: 561.50
State: Montana, Mean Verbal SAT: 660.00
State: Nebraska, Mean Verbal SAT: 660.00
State: Nevada, Mean Verbal SAT: 640.00
State: New Hampshire, Mean Verbal SAT: 600.00
State: New Jersey, Mean Verbal SAT: 640.00
State: New Mexico, Mean Verbal SAT: 660.00
State: New York, Mean Verbal SAT: 635.00
State: North Carolina, Mean Verbal SAT: 598.33
State: North Dakota, Mean Verbal SAT: 600.00
State: Ohio, Mean Verbal SAT: 682.50
State: Oklahoma, Mean Verbal SAT: 430.00
State: Oregon, Mean Verbal SAT: 690.00
State: Pennsylvania, Mean Verbal SAT: 641.00
State: Puerto Rico, Mean Verbal SAT: 540.00
State: Rhode Island, Mean Verbal SAT: 770.00
State: South Carolina, Mean Verbal SAT: 620.00
State: South Dakota, Mean Verbal SAT: 600.00
State: Tennessee, Mean Verbal SAT: 635.00
State: Texas, Mean Verbal SAT: 592.00
State: Utah, Mean Verbal SAT: 660.00
State: Vermont, Mean Verbal SAT: 710.00
State: Virginia, Mean Verbal SAT: 660.00
State: Washington, Mean Verbal SAT: 620.00
State: West Virginia, Mean Verbal SAT: 600.00
State: Wisconsin, Mean Verbal SAT: 655.00

Mean Verbal SAT of all states: 634.99

/var/folders/10/3dssf0p51vzgb7zfm9xl0vrm0000gn/T/ipykernel_12934/2992312094.py:10: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  df_sample = pd.concat([df_sample, sample_state[['State', col_verbal_sat]]], ignore_index=True)

In [94]:
step = 8
system_sample = df.iloc[::step] # slicing (start:stop:step)
mean_system_math = system_sample[col_math_sat].mean()
print(f'Mean Math SAT of system sample: {mean_system_math:.2f}')

Mean Math SAT of system sample: 627.34

In [95]:
states = df['State'].unique()
print(states, len(states))

['Alabama' 'Alaska' 'Arizona' 'Arkansas' 'California' 'Colorado'
 'Connecticut' 'Delaware' 'District of Columbia' 'Florida' 'Georgia'
 'Hawaii' 'Idaho' 'Illinois' 'Indiana' 'Iowa' 'Kansas' 'Kentucky'
 'Louisiana' 'Maine' 'Maryland' 'Massachusetts' 'Michigan' 'Minnesota'
 'Mississippi' 'Missouri' 'Montana' 'Nebraska' 'Nevada' 'New Hampshire'
 'New Jersey' 'New Mexico' 'New York' 'North Carolina' 'North Dakota'
 'Ohio' 'Oklahoma' 'Oregon' 'Pennsylvania' 'Rhode Island' 'South Carolina'
 'South Dakota' 'Tennessee' 'Texas' 'Utah' 'Vermont' 'Virginia'
 'Washington' 'West Virginia' 'Wisconsin' 'Puerto Rico'] 51

In [96]:
# get random 5 states
random_states = np.random.choice(states, 5, replace=False)
print(random_states)

['South Dakota' 'Illinois' 'Mississippi' 'Pennsylvania' 'Florida']

In [97]:
cluster_sample = df[df['State'].isin(random_states)]
mean_cluster_math = cluster_sample[col_math_sat].mean()
print(f'Mean Math SAT of cluster sample: {mean_cluster_math:.2f}')

Mean Math SAT of cluster sample: 623.20

In [99]:
# create empty DataFrame for cluster sample
cluster_sample = pd.DataFrame(columns=['State', col_math_sat])
for state in random_states:
    state_sample = df[df['State'] == state]
    cluster_sample = pd.concat([cluster_sample, state_sample], ignore_index=True)
    mean_state_math = state_sample[col_math_sat].mean()
    print(f'State: {state}, Mean Math SAT: {mean_state_math:.2f}')

mean_cluster_math = cluster_sample[col_math_sat].mean()
print(f'Mean Math SAT of cluster sample: {mean_cluster_math:.2f}')

State: South Dakota, Mean Math SAT: 605.56
State: Illinois, Mean Math SAT: 617.97
State: Mississippi, Mean Math SAT: 598.50
State: Pennsylvania, Mean Math SAT: 637.65
State: Florida, Mean Math SAT: 618.10
Mean Math SAT of cluster sample: 623.20

/var/folders/10/3dssf0p51vzgb7zfm9xl0vrm0000gn/T/ipykernel_12934/1268279879.py:5: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  cluster_sample = pd.concat([cluster_sample, state_sample], ignore_index=True)

In [107]:
alabama_all = df[df['State'] == 'Alabama']
sample_alabama = alabama_all.sample(len(alabama_all) // 10)
mean_alabama_math = sample_alabama[col_math_sat].mean()
print(f'Mean Math SAT of Alabama sample: {mean_alabama_math:.2f}')

Mean Math SAT of Alabama sample: 708.00